; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v12 ?v3)
             (pred_11 ?v8 ?v11)
             (pred_4 ?v12 ?v11)
             (pred_5 ?v2 ?v12 )
	     (pred_3 ?v12)
             (pred_2 ?v7)
             (pred_8 ?v8)
             (pred_6 ?v11)
             (pred_10 ?v12)
             (pred_1 ?v8)
             (pred_12 ?v12)
             (pred_7 ))



(:action op_1
:parameters (?v13 ?v4 ?v10 ?v5)
:precondition (and (pred_2 ?v13) (pred_2 ?v4) (pred_8 ?v10) (pred_6 ?v5)
          (pred_9 ?v13 ?v4) (pred_11 ?v10 ?v5)
                   (pred_4 ?v4 ?v5) (pred_3 ?v13) 
                   (pred_10 ?v4) (pred_1 ?v10))
:effect (and  (pred_12 ?v4) (not (pred_10 ?v4))))


(:action op_4
:parameters (?v13 ?v1)
:precondition (and (pred_2 ?v13) (pred_2 ?v1)
               (pred_3 ?v13) (pred_9 ?v13 ?v1) (pred_12 ?v1))
:effect (and (pred_3 ?v1) (not (pred_3 ?v13))))

(:action op_3
:parameters (?v13 ?v10)
:precondition (and (pred_2 ?v13) (pred_8 ?v10) 
                  (pred_3 ?v13) (pred_5 ?v10 ?v13) (pred_7 ))
:effect (and (pred_1 ?v10)
   (not (pred_5 ?v10 ?v13)) (not (pred_7 ))))


(:action op_2
:parameters (?v13 ?v9 ?v6)
:precondition (and (pred_2 ?v13) (pred_8 ?v9) (pred_8 ?v6)
                  (pred_3 ?v13) (pred_1 ?v6) (pred_5 ?v9 ?v13))
:effect (and (pred_1 ?v9) (pred_5 ?v6 ?v13)
        (not (pred_1 ?v6)) (not (pred_5 ?v9 ?v13))))

(:action op_5
:parameters (?v13 ?v10)
:precondition (and (pred_2 ?v13) (pred_8 ?v10) 
                  (pred_3 ?v13) (pred_1 ?v10))
:effect (and (pred_7 ) (pred_5 ?v10 ?v13) (not (pred_1 ?v10)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_04 obj_14 obj_20 obj_17 obj_30 obj_07 obj_31 obj_15 obj_18 obj_01 obj_08 obj_12 obj_28 obj_29 obj_16 obj_26 obj_03 obj_24 obj_11 obj_05 obj_10 obj_27 obj_23 obj_06 obj_13
    obj_09 obj_25 obj_21
    obj_02 obj_19 obj_22
    )

    (:init
       (pred_7)

       (pred_2 obj_04)
       (pred_2 obj_14)
       (pred_2 obj_20)
       (pred_2 obj_17)
       (pred_2 obj_30)
       (pred_2 obj_07)
       (pred_2 obj_31)
       (pred_2 obj_15)
       (pred_2 obj_18)
       (pred_2 obj_01)
       (pred_2 obj_08)
       (pred_2 obj_12)
       (pred_2 obj_28)
       (pred_2 obj_29)
       (pred_2 obj_16)
       (pred_2 obj_26)
       (pred_2 obj_03)
       (pred_2 obj_24)
       (pred_2 obj_11)
       (pred_2 obj_05)
       (pred_2 obj_10)
       (pred_2 obj_27)
       (pred_2 obj_23)
       (pred_2 obj_06)
       (pred_2 obj_13)
       (pred_6 obj_09)
       (pred_6 obj_25)
       (pred_6 obj_21)
       (pred_8 obj_02)
       (pred_8 obj_19)
       (pred_8 obj_22)

       (pred_9 obj_04 obj_07)
       (pred_9 obj_04 obj_14)
       (pred_9 obj_14 obj_31)
       (pred_9 obj_14 obj_20)
       (pred_9 obj_14 obj_04)
       (pred_9 obj_20 obj_15)
       (pred_9 obj_20 obj_17)
       (pred_9 obj_20 obj_14)
       (pred_9 obj_17 obj_18)
       (pred_9 obj_17 obj_30)
       (pred_9 obj_17 obj_20)
       (pred_9 obj_30 obj_01)
       (pred_9 obj_30 obj_17)
       (pred_9 obj_07 obj_08)
       (pred_9 obj_07 obj_31)
       (pred_9 obj_07 obj_04)
       (pred_9 obj_31 obj_12)
       (pred_9 obj_31 obj_15)
       (pred_9 obj_31 obj_14)
       (pred_9 obj_31 obj_07)
       (pred_9 obj_15 obj_28)
       (pred_9 obj_15 obj_18)
       (pred_9 obj_15 obj_20)
       (pred_9 obj_15 obj_31)
       (pred_9 obj_18 obj_29)
       (pred_9 obj_18 obj_01)
       (pred_9 obj_18 obj_17)
       (pred_9 obj_18 obj_15)
       (pred_9 obj_01 obj_16)
       (pred_9 obj_01 obj_30)
       (pred_9 obj_01 obj_18)
       (pred_9 obj_08 obj_26)
       (pred_9 obj_08 obj_12)
       (pred_9 obj_08 obj_07)
       (pred_9 obj_12 obj_03)
       (pred_9 obj_12 obj_28)
       (pred_9 obj_12 obj_31)
       (pred_9 obj_12 obj_08)
       (pred_9 obj_28 obj_24)
       (pred_9 obj_28 obj_29)
       (pred_9 obj_28 obj_15)
       (pred_9 obj_28 obj_12)
       (pred_9 obj_29 obj_11)
       (pred_9 obj_29 obj_16)
       (pred_9 obj_29 obj_18)
       (pred_9 obj_29 obj_28)
       (pred_9 obj_16 obj_05)
       (pred_9 obj_16 obj_01)
       (pred_9 obj_16 obj_29)
       (pred_9 obj_26 obj_10)
       (pred_9 obj_26 obj_03)
       (pred_9 obj_26 obj_08)
       (pred_9 obj_03 obj_27)
       (pred_9 obj_03 obj_24)
       (pred_9 obj_03 obj_12)
       (pred_9 obj_03 obj_26)
       (pred_9 obj_24 obj_23)
       (pred_9 obj_24 obj_11)
       (pred_9 obj_24 obj_28)
       (pred_9 obj_24 obj_03)
       (pred_9 obj_11 obj_06)
       (pred_9 obj_11 obj_05)
       (pred_9 obj_11 obj_29)
       (pred_9 obj_11 obj_24)
       (pred_9 obj_05 obj_13)
       (pred_9 obj_05 obj_16)
       (pred_9 obj_05 obj_11)
       (pred_9 obj_10 obj_27)
       (pred_9 obj_10 obj_26)
       (pred_9 obj_27 obj_23)
       (pred_9 obj_27 obj_03)
       (pred_9 obj_27 obj_10)
       (pred_9 obj_23 obj_06)
       (pred_9 obj_23 obj_24)
       (pred_9 obj_23 obj_27)
       (pred_9 obj_06 obj_13)
       (pred_9 obj_06 obj_11)
       (pred_9 obj_06 obj_23)
       (pred_9 obj_13 obj_05)
       (pred_9 obj_13 obj_06)
       (pred_10 obj_28)
       (pred_10 obj_14)
       (pred_10 obj_15)
       (pred_4  obj_28 obj_09)
       (pred_4  obj_14 obj_25)
       (pred_4  obj_15 obj_21)
       (pred_12 obj_04)
       (pred_12 obj_20)
       (pred_12 obj_17)
       (pred_12 obj_30)
       (pred_12 obj_07)
       (pred_12 obj_31)
       (pred_12 obj_18)
       (pred_12 obj_01)
       (pred_12 obj_08)
       (pred_12 obj_12)
       (pred_12 obj_29)
       (pred_12 obj_16)
       (pred_12 obj_26)
       (pred_12 obj_03)
       (pred_12 obj_24)
       (pred_12 obj_11)
       (pred_12 obj_05)
       (pred_12 obj_10)
       (pred_12 obj_27)
       (pred_12 obj_23)
       (pred_12 obj_06)
       (pred_12 obj_13)

       (pred_11  obj_02 obj_09)
       (pred_11  obj_19 obj_25)
       (pred_11  obj_22 obj_21)
       (pred_5 obj_02 obj_03)
       (pred_5 obj_19 obj_26)
       (pred_5 obj_22 obj_03)
       (pred_3 obj_27)
    )

    (:goal (and
       (pred_5 obj_22 obj_18)
    ))
(:constraints
  (always (not (pred_3 obj_11)))
)
)

; plan
1. (op_4 obj_27 obj_03)
   deleted: (pred_3 obj_27)
   added: (pred_3 obj_03)
   goals met: 0 of 1
2. (op_3 obj_03 obj_22)
   deleted: (pred_5 obj_22 obj_03) (pred_7)
   added: (pred_1 obj_22)
   goals met: 0 of 1
3. (op_4 obj_03 obj_12)
   deleted: (pred_3 obj_03)
   added: (pred_3 obj_12)
   goals met: 0 of 1
4. (op_4 obj_12 obj_31)
   deleted: (pred_3 obj_12)
   added: (pred_3 obj_31)
   goals met: 0 of 1
5. (op_1 obj_31 obj_15 obj_22 obj_21)
   deleted: (pred_10 obj_15)
   added: (pred_12 obj_15)
   goals met: 0 of 1
6. (op_4 obj_31 obj_15)
   deleted: (pred_3 obj_31)
   added: (pred_3 obj_15)
   goals met: 0 of 1
7. (op_4 obj_15 obj_18)
   deleted: (pred_3 obj_15)
   added: (pred_3 obj_18)
   goals met: 0 of 1
8. (op_5 obj_18 obj_22)
   deleted: (pred_1 obj_22)
   added: (pred_7) (pred_5 obj_22 obj_18)
   goals met: 1 of 1
